# 公众号配置
# 公众号appId
app_id = "wx6b417c9e548a62d4"
# 公众号appSecret
app_secret = "65cb00e4360bfb836eeac0daf211b8e0"
# 模板消息id
template_id = "YvWbHhdfX8RmtG7sI3dLo3408rRkMvc1lhj7m7assxM"

# 这是openid
user = ["ozGTa6c8q_UblP3D1m7U2PC7eggk","ozGTa6Zo4Qr0pH7xH_70HtLNUSxw"]

# 信息配置
# 所在省份
province = "湖北"
# 所在城市
city = "武汉"
# 生日，如果月份或者日期小于10，直接用对应的数字即可，例如1997-1-1
birthday = "2002-11-11"
# 在一起的日子，格式同上
love_date = "2021-10-11"
# 课程 从周一开始
classes = [
    [['场地分析与竖向设计 12-13,16周 景园楼309', '马克思主义基本原理 1,3,4,6,7-9,11-13周 三教B302', '建筑设计 3-4 6-9 12-16周 景园楼213', '建筑设计 3-4 6-9 12-16周 景园楼213', ''],
     ['城市规划与设计原理 1-9，12-14周 四教B102', '形体健身C 1-15周 西体育馆', '设计表达 1-3 4,6 7-9 12-15周 景园楼213', '设计表达 1-3 4,6 7-9 12-15周 景园楼213', ''],
     ['', '', '马克思主义基本原理 1-9 12-13周 三教B302', '风景园林政策与法规 1-9周 三教B304', ''],
     ['场地分析与竖向设计 1-9 12-16周 景园楼309', '城市规划与设计原理 1-9,12-14周 四教B102', '风景水彩 1-4,6-9周 景园楼105', '风景水彩 1-4,6-9周 景园楼105', ''],
     ['风景园林政策与法规 1-6,8周 四教A104', '雅思阅读 1-6 8-10 12-17周 四教A109', '地理信息系统应用 1,3 4-9周 园林楼224', '地理信息系统应用 1,3 4-9周 园林楼224', ''],
     ['', '', '', '', ''],
     ['', '', '', '', '']],

    [['场地分析与竖向设计 12-13,16周 景园楼309', '马克思主义基本原理 1,3,4,6,7-9,11-13周 三教B302', '建筑设计 3-4 6-9 12-16周 景园楼213', '建筑设计 3-4 6-9 12-16周 景园楼213', ''],
     ['城市规划与设计原理 1-9，12-14周 四教B102', '形体健身C 1-15周 西体育馆', '设计表达 1-3 4,6 7-9 12-15周 景园楼213', '设计表达 1-3 4,6 7-9 12-15周 景园楼213', ''],
     ['', '', '马克思主义基本原理 1-9 12-13周 三教B302', '风景园林政策与法规 1-9周 三教B304', ''],
     ['场地分析与竖向设计 1-9 12-16周 景园楼309', '城市规划与设计原理 1-9,12-14周 四教B102', '风景水彩 1-4,6-9周 景园楼105', '风景水彩 1-4,6-9周 景园楼105', ''],
     ['风景园林政策与法规 1-6,8周 四教A104', '雅思阅读 1-6 8-10 12-17周 四教A109', '地理信息系统应用 1,3 4-9周 园林楼224', '地理信息系统应用 1,3 4-9周 园林楼224', ''],
     ['', '', '', '', ''],
     ['', '', '', '', '']
     ]
]
